app/views/users/show.html.erb


<% if @user.convoyd_files.present? %>
---
SELECT "convoyd_files".* FROM "convoyd_files" WHERE "convoyd_files"."user_id" = 1