app/views/convoyd_files/show.html.erb

<p>
  <%= @convoyd_file.user.first_name %>'s file
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1