app/controllers/convoyd_files_controller.rb

  def index
    @convoyd_files = ConvoydFile.all
---
SELECT "convoyd_files".* FROM "convoyd_files"

  def show
    @convoyd_file = ConvoydFile.find(params[:id])
---
SELECT "convoyd_files".* FROM "convoyd_files" WHERE "convoyd_files"."id" = ? LIMIT 1  [["id", "3"]]

  def new
    @convoyd_file = ConvoydFile.new
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @convoyd_file = ConvoydFile.new(params[:convoyd_file])
    @user = User.find(params[:user_id])

    if @convoyd_file.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "convoyd_files" ("convoyd_key", "created_at", "crypted_password", "status", "updated_at", "upload", "upload_content_type", "upload_file_name", "upload_file_size", "upload_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @convoyd_file = ConvoydFile.find(params[:id])
    @user = User.find(params[:user_id])
    @convoyd_file.destroy
---
SELECT "convoyd_files".* FROM "convoyd_files" WHERE "convoyd_files"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "convoyd_files" WHERE "convoyd_files"."id" = ?  [["id", 1]]

  def download
    @convoyd_file = ConvoydFile.find(params[:id])
---
SELECT "convoyd_files".* FROM "convoyd_files" WHERE "convoyd_files"."id" = ? LIMIT 1  [["id", "6"]]

  def authenticate
    @convoyd_file = ConvoydFile.find(params[:id])
---
SELECT "convoyd_files".* FROM "convoyd_files" WHERE "convoyd_files"."id" = ? LIMIT 1  [["id", "7"]]

  def check_authentication
    @convoyd_file = ConvoydFile.find(params[:id])
---
SELECT "convoyd_files".* FROM "convoyd_files" WHERE "convoyd_files"."id" = ? LIMIT 1  [["id", "7"]]