app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "email", "first_name", "last_name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "salt" = '1mMoXcPbqzoUjW3D2H1n', "crypted_password" = '$2a$10$DZ1bq.5VGrEGbHZvoWB7tejzabc5IzL6YiFYHHhkWkD0v7MmBC5ie', "updated_at" = '2011-12-06 17:46:32.879270' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])